/**
 * Выбросить случайное целое число и сохранить в i
 * Посчитать и сохранить в n номер старшего значащего бита выпавшего числа
 * Найти все кратные n числа большие i и сохранить в массив m1
 * Найти все некратные n числа меньшие i и сохранить в массив m2
 * Сохранить оба массива в файлы с именами m1 и m2 соответственно.
 *
 * Пункты реализовать в методе main
 * *Пункты реализовать в разных методах
 * **Реализовать один из пунктов рекурсией
 */

public class HighBitNumber {
    public static void main(String[] args) {



    }
}
